[Killed] Block removal mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:33:5
     /// Inicializa una nueva instancia de <see cref="BankAccount"/>.
     /// </summary>
     public BankAccount(string customerName, double balance)
-    {
-        m_customerName = customerName;
-        m_balance = balance;
-    }
+    {}
 
     /// <summary>
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountEqualsBalance_AllowsDebit; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:53:13
     /// </summary>
     public void Debit(double amount)
     {
-        if (amount > m_balance)
+        if (amount < m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountIsNegative_ThrowsArgumentOutOfRangeException; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:53:13
     /// </summary>
     public void Debit(double amount)
     {
-        if (amount > m_balance)
+        if (amount >= m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountEqualsBalance_AllowsDebit

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:54:13
     public void Debit(double amount)
     {
         if (amount > m_balance)
-            throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
+            ;
         if (amount < 0)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountExceedsBalance_ThrowsArgumentOutOfRangeException

[Killed] Negate expression
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:55:13
     {
         if (amount > m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
-        if (amount < 0)
+        if (!(amount < 0))
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
         m_balance -= amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountEqualsBalance_AllowsDebit; Bank.Domain.Tests.BankAccountTests.Debit_AmountIsNegative_ThrowsArgumentOutOfRangeException; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:55:13
     {
         if (amount > m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
-        if (amount < 0)
+        if (amount <= 0)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
         m_balance -= amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountIsZero_AllowsDebit

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:56:13
         if (amount > m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
-            throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
+            ;
         m_balance -= amount;
     }
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountIsNegative_ThrowsArgumentOutOfRangeException; Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:57:9
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
-        m_balance -= amount;
+        m_balance += amount;
     }
 
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_AmountEqualsBalance_AllowsDebit; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:65:13
     /// </summary>
     public void Credit(double amount)
     {
-        if (amount < 0)
+        if (amount <= 0)
             throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
         m_balance += amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_ZeroAmount_AddsNothing

[Killed] Negate expression
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:65:13
     /// </summary>
     public void Credit(double amount)
     {
-        if (amount < 0)
+        if (!(amount < 0))
             throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
         m_balance += amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.Credit_ZeroAmount_AddsNothing; Bank.Domain.Tests.BankAccountTests.Credit_NegativeAmount_ThrowsArgumentOutOfRangeException

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:66:13
     public void Credit(double amount)
     {
         if (amount < 0)
-            throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
+            ;
         m_balance += amount;
     }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_NegativeAmount_ThrowsArgumentOutOfRangeException

[Killed] String mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:66:69
     public void Credit(double amount)
     {
         if (amount < 0)
-            throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
+            throw new ArgumentOutOfRangeException("amount", amount, "");
         m_balance += amount;
     }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_NegativeAmount_ThrowsArgumentOutOfRangeException

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:67:9
     {
         if (amount < 0)
             throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
-        m_balance += amount;
+        m_balance -= amount;
     }
 }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WithValidAmount_UpdatesBalance
