[Killed] String mutation
lab-2025-i-si784-u2-05-cs-srg-cp/Bank/Bank.Domain/BankAccount.cs:68:55
         public void Credit(double amount)
         {
             if (amount < 0)
-                throw new ArgumentOutOfRangeException("amount", amount, "Credit amount must be positive");
+                throw new ArgumentOutOfRangeException("", amount, "Credit amount must be positive");
             m_balance += amount;
         }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_NegativeAmount_ThrowsArgumentOutOfRangeException
